In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:123456@127.0.0.1/sparkifydb

In [257]:
%sql SELECT * FROM dim.account_manager;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
3 rows affected.

[(1, 1, 1, datetime.date(2021, 9, 30), datetime.date(2021, 10, 30), 123, 456),
 (2, 2, 2, datetime.date(2021, 8, 1), datetime.date(2021, 9, 1), 123, 456),
 (3, 3, 3, datetime.date(2021, 8, 1), datetime.date(2021, 9, 30), 123, 456)]

In [256]:
%sql SELECT * FROM dim.customer;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
3 rows affected.

[(1, 'Quy', 'B2B', 'Nothing', 'No', 'VN', datetime.date(2019, 9, 15)),
 (2, 'Nguyen', 'B2B', 'Nothing', 'No', 'SG', datetime.date(2019, 9, 30)),
 (3, 'Huong', 'B2B', 'Nothing', 'No', 'UK', datetime.date(2019, 9, 30))]

In [306]:
%sql UPDATE fact.sale_order SET order_date_id = 20210715 WHERE sale_order_id = 12;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[]

In [303]:
%sql SELECT * FROM fact.sale_order;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
11 rows affected.

[(5, None, datetime.date(2021, 9, 7), 20210907, datetime.date(2021, 10, 30), 1234, datetime.date(2021, 11, 15), 12312, 1, None, None, 0, 'D'),
 (6, None, datetime.date(2021, 9, 7), 20210907, datetime.date(2021, 10, 30), 1234, datetime.date(2021, 11, 15), 12312, 2, None, None, 0, 'D'),
 (7, None, datetime.date(2021, 9, 7), 20210907, datetime.date(2021, 10, 30), 1234, datetime.date(2021, 11, 15), 12312, 2, 1, None, 0, 'D'),
 (8, None, datetime.date(2021, 9, 7), 20210907, datetime.date(2021, 12, 30), 1234, datetime.date(2021, 12, 31), 12312, 3, None, None, 0, 'R'),
 (9, None, datetime.date(2021, 9, 7), 20210907, datetime.date(2021, 12, 1), 1234, datetime.date(2021, 12, 30), 12312, 3, 2, None, 0, 'S'),
 (10, None, datetime.date(2021, 8, 7), 20210907, datetime.date(2021, 12, 1), 1234, datetime.date(2021, 12, 30), 12312, 3, 1, None, 0, 'D'),
 (11, None, datetime.date(2021, 8, 1), 20210907, datetime.date(2021, 12, 5), 1234, datetime.date(2021, 12, 31), 12312, 2, 3, None, 0, 'D'),
 (12, None, datetime.date(2021, 7, 15), 20210907, datetime.date(2021, 11, 5), 1234, datetime.date(2021, 11, 30), 12312, 4, 4, None, 20, 'D'),
 (1, None, datetime.date(2019, 9, 2), 20210902, datetime.date(2021, 10, 30), 1234, datetime.date(2021, 11, 15), 12312, 1, None, None, 0, 'V'),
 (2, None, datetime.date(2021, 9, 2), 20210902, datetime.date(2021, 10, 30), 1234, datetime.date(2021, 11, 15), 12312, 1, None, None, 0, 'V'),
 (3, None, datetime.date(2021, 9, 2), 20210902, datetime.date(2021, 10, 30), 1234, datetime.date(2021, 11, 15), 12312, 1, 2, None, 0, 'D')]

In [276]:
%sql SELECT * FROM fact.sale_order_line_item;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
20 rows affected.

[(1, 1, 1, 345, 5, Decimal('150.05'), Decimal('130.6')),
 (2, 3, 1, 789, 2, Decimal('550.05'), Decimal('430.6')),
 (3, 2, 1, 234, 1, Decimal('150.05'), Decimal('130.6')),
 (5, 2, 2, 567, 2, Decimal('50.05'), Decimal('30.6')),
 (6, 5, 1, 123, 1, Decimal('500.05'), Decimal('350.6')),
 (7, 6, 1, 234, 5, Decimal('100.05'), Decimal('50.6')),
 (8, 7, 1, 234, 3, Decimal('100.05'), Decimal('50.6')),
 (9, 7, 2, 456, 1, Decimal('10.05'), Decimal('5.6')),
 (10, 7, 3, 678, 2, Decimal('20.05'), Decimal('15.6')),
 (11, 8, 1, 123, 1, Decimal('120.05'), Decimal('115.6')),
 (12, 8, 2, 345, 3, Decimal('10.05'), Decimal('9.6')),
 (13, 9, 1, 456, 1, Decimal('10.05'), Decimal('9.6')),
 (14, 9, 2, 456, 3, Decimal('10.05'), Decimal('9.6')),
 (15, 10, 1, 123, 1, Decimal('10.05'), Decimal('9.6')),
 (16, 10, 2, 678, 1, Decimal('100.05'), Decimal('90.6')),
 (17, 11, 1, 234, 1, Decimal('500.05'), Decimal('940.6')),
 (18, 11, 2, 678, 2, Decimal('50.05'), Decimal('40.6')),
 (19, 11, 3, 789, 5, Decimal('50.05'), Decimal('40.6')),
 (20, 12, 1, 123, 1, Decimal('50.05'), Decimal('40.6')),
 (21, 12, 2, 567, 2, Decimal('550.05'), Decimal('540.6'))]

In [183]:
%sql SELECT * FROM dim.product;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
7 rows affected.

[(123, 'Test1', '123', 'PL1'),
 (345, 'Test2', '345', 'PL2'),
 (789, 'Test3', '789', 'PL3'),
 (234, 'Test4', '234', 'PL3'),
 (567, 'Test5', '567', 'PL1'),
 (456, 'Test6', '456', 'PL2'),
 (678, 'Test7', '678', 'PL2')]

In [120]:
%sql DELETE FROM fact.sale_ordeR WHERE sale_order_id = 4;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[]

In [169]:
%sql drop view sale

 * postgresql://postgres:***@127.0.0.1/sparkifydb
Done.

[]

In [322]:
%%sql result << 
SELECT a.account_manager, CAST(LEFT(CAST(s.order_date_id AS varchar(8)), 6) AS INT) order_date_id,  SUM(CASE WHEN s.order_date >= a.efected_date 
							AND s.order_date <= a.expired_date 
							THEN s.sale_amount ELSE 0 END) total_sale
FROM (SELECT s.order_date, s.order_date_id, s.customer_id, SUM(l.quantity * l.listed_price) sale_amount
	FROM fact.sale_order s 
	JOIN fact.sale_order_line_item l 
	ON s.sale_order_id = l.sale_order_id
	WHERE s.order_date >= '2021-01-01' AND s.order_date <= '2021-12-31'
	GROUP BY s.order_date, s.order_date_id, s.customer_id) s
JOIN dim.account_manager a
ON s.customer_id = a.customer_id
GROUP BY a.account_manager, order_date_id;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
7 rows affected.
Returning data to local variable result

In [323]:
result

[(1, 202107, Decimal('1150.15')),
 (1, 202109, Decimal('0')),
 (1, 202109, Decimal('0')),
 (2, 202108, Decimal('850.40')),
 (2, 202109, Decimal('0')),
 (3, 202108, Decimal('110.10')),
 (3, 202109, Decimal('190.40'))]

In [296]:
%%sql result1 << 
WITH product_sale AS
(SELECT s.product_id, a.account_manager, SUM(CASE WHEN s.order_date >= a.efected_date 
							AND s.order_date <= a.expired_date 
							THEN s.sale_amount ELSE 0 END) total_sale
FROM (SELECT l.product_id, s.order_date, s.customer_id, SUM(l.quantity * l.listed_price) sale_amount
	FROM fact.sale_order s 
	JOIN fact.sale_order_line_item l 
	ON s.sale_order_id = l.sale_order_id
	WHERE s.order_date >= '2021-01-01' AND s.order_date <= '2021-12-31'
	GROUP BY l.product_id, s.order_date, s.customer_id) s
JOIN dim.account_manager a
ON s.customer_id = a.customer_id
GROUP BY s.product_id, a.account_manager
)

SELECT temp.product_id, temp.account_manager, temp.total_sale
FROM (SELECT product_id, account_manager, total_sale, ROW_NUMBER()
		OVER (PARTITION BY product_id ORDER BY total_sale DESC) as rowno
		FROM product_sale) AS temp
WHERE temp.rowno <= 3;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
12 rows affected.
Returning data to local variable result1

In [297]:
result1

[(123, 3, Decimal('130.10')),
 (123, 1, Decimal('50.05')),
 (234, 2, Decimal('500.05')),
 (234, 1, Decimal('0')),
 (345, 3, Decimal('30.15')),
 (456, 3, Decimal('40.20')),
 (456, 2, Decimal('0')),
 (567, 1, Decimal('1100.10')),
 (678, 2, Decimal('100.10')),
 (678, 3, Decimal('100.05')),
 (789, 2, Decimal('250.25')),
 (789, 1, Decimal('0'))]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892')),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', Decimal('NaN'), Decimal('NaN')),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', Decimal('NaN'), Decimal('NaN')),
 ('ARXR32B1187FB57099', 'Gob', '', Decimal('NaN'), Decimal('NaN'))]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(1541106106796, 21, 1, 44, 11, 2018, 'Thursday'),
 (1541106352796, 21, 1, 44, 11, 2018, 'Thursday'),
 (1541106496796, 21, 1, 44, 11, 2018, 'Thursday'),
 (1541106673796, 21, 1, 44, 11, 2018, 'Thursday'),
 (1541107053796, 21, 1, 44, 11, 2018, 'Thursday')]

In [9]:
%sql SELECT COUNT(*) FROM time;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
1 rows affected.

[(6813,)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).